In [ ]:
#data frames

In [ ]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])

In [ ]:
df

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [ ]:
df2=df.to_csv('store.csv') #write dataframe in to csv file

In [ ]:
df.loc["Store 2"]

Cost                      5
Item Purchased    Bird Seed
Name                  Vinod
Name: Store 2, dtype: object

In [ ]:
type(df.loc["Store 2"])

pandas.core.series.Series

In [ ]:
df["Name"]

Store 1    Chris
Store 1    Kevyn
Store 2    Vinod
Name: Name, dtype: object

In [ ]:
type(df["Name"])

pandas.core.series.Series

In [ ]:
df.loc["Store 1"]

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn

In [ ]:
type(df.loc['Store 1'])

pandas.core.frame.DataFrame

In [ ]:
df.loc["Store 1","Cost"]

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [ ]:
df.T

                 Store 1       Store 1    Store 2
Cost                22.5           2.5          5
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Name               Chris         Kevyn      Vinod

In [ ]:
df.T.loc["Cost"]

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [ ]:
df.loc[:,["Name","Cost"]]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [ ]:
df.drop("Store 1")

         Cost Item Purchased   Name
Store 2   5.0      Bird Seed  Vinod

In [ ]:
df

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [ ]:
df1=df.copy()

In [ ]:
df1

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [ ]:
df1=df.drop("Store 1")

In [ ]:
df1

         Cost Item Purchased   Name
Store 2   5.0      Bird Seed  Vinod

In [ ]:
del df1["Name"]

In [ ]:
df1

         Cost Item Purchased
Store 2   5.0      Bird Seed

In [ ]:
df['location']=None

In [ ]:
df

         Cost Item Purchased   Name location
Store 1  22.5       Dog Food  Chris     None
Store 1   2.5   Kitty Litter  Kevyn     None
Store 2   5.0      Bird Seed  Vinod     None

In [ ]:
Costs=df["Cost"]

In [ ]:
Costs+=2

In [ ]:
df

         Cost Item Purchased   Name location
Store 1  24.5       Dog Food  Chris     None
Store 1   4.5   Kitty Litter  Kevyn     None
Store 2   7.0      Bird Seed  Vinod     None

In [ ]:
df.iloc[0:2,0:2]

         Cost Item Purchased
Store 1  22.5       Dog Food
Store 1   2.5   Kitty Litter

In [ ]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})


df2 = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 2', 'Store 3'])

In [ ]:
df2

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 2   2.5   Kitty Litter  Kevyn
Store 3   5.0      Bird Seed  Vinod

In [ ]:
df2['location']=None

In [ ]:
df2

         Cost Item Purchased   Name location
Store 1  22.5       Dog Food  Chris     None
Store 2   2.5   Kitty Litter  Kevyn     None
Store 3   5.0      Bird Seed  Vinod     None

In [ ]:
df2.loc["Store 1":"Store 3","Cost":"Name"]

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 2   2.5   Kitty Litter  Kevyn
Store 3   5.0      Bird Seed  Vinod

In [ ]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_1

Cost                  22.5
Item Purchased    Dog Food
Name                 Chris
dtype: object